{
  "lastUpdated": "2026-02-06",
  "filingDeadline": "2026-03-10T18:00:00Z",
  "watching": [
    { "name": "Tre Hargett", "role": "Tennessee Secretary of State", "party": "rep", "status": "watching", "likelihood": 25, "detail": "Hargett has served as Secretary of State since 2009, giving him deep familiarity with state government. His name has surfaced in Republican circles as a potential establishment alternative, though he has not made any public moves toward a campaign." },
    { "name": "Diana Harshbarger", "role": "U.S. Representative, TN-1", "party": "rep", "status": "watching", "likelihood": 15, "detail": "Pharmacist and businesswoman representing northeast Tennessee since 2021. A Trump ally mentioned in governor's race speculation, though no public statements have confirmed interest." },
    { "name": "Lee Harris", "role": "Shelby County Mayor", "party": "dem", "status": "possible", "likelihood": 20, "detail": "Harris has been floated as the strongest potential Democratic candidate who hasn't entered the race. As Shelby County Mayor, he governs the state's most populous county and has high name recognition in Memphis." },
    { "name": "Steve Cohen", "role": "U.S. Representative, TN-9", "party": "dem", "status": "watching", "likelihood": 10, "detail": "The longtime Memphis congressman has represented TN-9 since 2007. At 76, a gubernatorial run would be a significant career shift. Has not publicly commented on interest." }
  ],
  "declined": [
    { "name": "Bill Hagerty", "role": "U.S. Senator", "party": "rep", "status": "Running for Senate", "detail": "Widely discussed as a potential Republican candidate before Blackburn entered. Confirmed he is running for re-election to the U.S. Senate in 2026." },
    { "name": "Mark Green", "role": "Former U.S. Representative, TN-7", "party": "rep", "status": "Not Running", "detail": "Left the House in 2025. Name was floated in early speculation, but has endorsed Blackburn and made no moves toward his own campaign." },
    { "name": "Glenn Jacobs", "role": "Knox County Mayor", "party": "rep", "status": "Endorsed Blackburn", "detail": "Rumored as a potential candidate, but instead endorsed Blackburn and is serving as her campaign treasurer." }
  ],
  "analysis": {
    "trump": "The single biggest wildcard in this race remains a Trump endorsement. As of February 2026, President Trump has not endorsed in the Republican primary. Blackburn is widely considered the front-runner for his backing given her close Senate alliance, but Rose has been positioning himself as a 'Tennessee first' conservative. A late Trump endorsement could effectively end the primary.",
    "postDeadline": "Once the filing deadline passes at noon on March 10, the field is locked and no new candidates can enter. This watchlist will then transition into a historical reference showing who ran, who passed, and what the final field looks like heading into primary season."
  }
}
